# Пользователь вводит предложение,
# заменить все пробелы на "-"
# 2-мя способами

input_line = input("Напишите предложение...")
print(input_line)


chang_line = input_line.replace(" ", "-")
print(chang_line)




