# Дан словарь, ключ - Название страны, значение - список городов, на вход
# поступает город, необходимо сказать из какой он страны

def gor(country: dict, city: str):
    keys_c = list(country.keys())
    itm_l = []
    i = 0
    while i < len(keys_c):
        if city in country[keys_c[i]]:
            itm_l.append(keys_c[i])
        i += 1
    if not itm_l:
        itm_l.append("Нет страны с таким городом.")
    return " и ".join(itm_l)


country = {
    "Италия": ["Рим", "Милан", "Флоренция"],
    "Испания": ["Барселона", "Мадрид", "Севилья", "Гранада", "Пальма"],
    "Китай": ["Пекин", "Шанхай"],
    "Беларусь": ["Минск", "Гродно", "Витебск", "Пинск", "Брест"],
    "Франция": ["Париж", "Брест"]
}

city = "Брест"
print(gor(country, city))
